InformationRegisters/СостоянияСинхронизацииСЦентромЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияСинхронизацииСЦентромЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МеткаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСинхронизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСинхронизацииСЦентромЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиИнтеграцииЦентраЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииЦентраЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьЦентраЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЦентровЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяЗавершитьПереходВЦентрЭДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСинхронизацииСЦентромЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСинхронизацииСЦентромЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументыЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашенияЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетныеЗаписиЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДанныеДокументовЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатусыДоверенностей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортныеКонтейнерыЭДО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СостоянияСинхронизацииСЦентромЭДО/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ИдентификаторЭДО - См. РегистрСведений.СостоянияСинхронизацииСЦентромЭДО.ИдентификаторЭДО
//  ТипСинхронизации - См. РегистрСведений.СостоянияСинхронизацииСЦентромЭДО.ТипСинхронизации
//  МеткаВремени - См. РегистрСведений.СостоянияСинхронизацииСЦентромЭДО.МеткаВремени
Процедура Записать(ИдентификаторЭДО, ТипСинхронизации, МеткаВремени) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(ИдентификаторЭДО);
	НаборЗаписей.Отбор.ТипСинхронизации.Установить(ТипСинхронизации);
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.ИдентификаторЭДО = ИдентификаторЭДО;
	ЗаписьНабора.ТипСинхронизации = ТипСинхронизации;
	ЗаписьНабора.МеткаВремени = МеткаВремени;
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Параметры:
//  ТипСинхронизации - См. РегистрСведений.СостоянияСинхронизацииСЦентромЭДО.ТипСинхронизации
//  МеткиВремениПоИдентификаторамЭДО - Соответствие из КлючИЗначение:
//  * Ключ - Строка
//  * Значение - Число
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
Процедура ЗаписатьКоллекцию(ТипСинхронизации, МеткиВремениПоИдентификаторамЭДО, КонтекстДиагностики) Экспорт
	
	Для Каждого МеткаВремениПоИдентификаторуЭДО Из МеткиВремениПоИдентификаторамЭДО Цикл
		
		ИдентификаторЭДО = МеткаВремениПоИдентификаторуЭДО.Ключ;
		МеткаВремени = МеткаВремениПоИдентификаторуЭДО.Значение;
		
		Попытка
			Записать(ИдентификаторЭДО, ТипСинхронизации, МеткаВремени);
		Исключение
			ВидОперации = НСтр("ru = 'Синхронизация с центром ЭДО'");
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось зафиксировать состояние синхронизации с центром ЭДО
				|для типа данных %1 по идентификатору ЭДО %2'"), ТипСинхронизации, ИдентификаторЭДО);
			ТекстОшибкиПодробно = ТекстОшибки + Символы.ПС
				+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИнтеграцияЦентраЭДО.ДобавитьНеизвестнуюОшибку(КонтекстДиагностики, ВидОперации,
				ТекстОшибки, ТекстОшибкиПодробно);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  ИдентификаторыЭДО - Массив из см. РегистрСведений.СостоянияСинхронизацииСЦентромЭДО.ИдентификаторЭДО
//  ТипыСинхронизации - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО,Массив из ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * ИдентификаторЭДО - См. РегистрСведений.СостоянияСинхронизацииСЦентромЭДО.ИдентификаторЭДО
//  * ТипСинхронизации - См. РегистрСведений.СостоянияСинхронизацииСЦентромЭДО.ТипСинхронизации
//  * МеткаВремени - См. РегистрСведений.СостоянияСинхронизацииСЦентромЭДО.МеткаВремени
Функция Выгрузить(ИдентификаторыЭДО = Неопределено, ТипыСинхронизации = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостоянияСинхронизацииСЦентромЭДО.ИдентификаторЭДО КАК ИдентификаторЭДО,
		|	СостоянияСинхронизацииСЦентромЭДО.ТипСинхронизации КАК ТипСинхронизации,
		|	СостоянияСинхронизацииСЦентромЭДО.МеткаВремени КАК МеткаВремени
		|ИЗ
		|	РегистрСведений.СостоянияСинхронизацииСЦентромЭДО КАК СостоянияСинхронизацииСЦентромЭДО
		|ГДЕ
		|	&УсловияОтбора";
	
	УсловияОтбора = Новый Массив; // Массив из Строка
	
	Если ЗначениеЗаполнено(ИдентификаторыЭДО) Тогда
		УсловияОтбора.Добавить("СостоянияСинхронизацииСЦентромЭДО.ИдентификаторЭДО В (&ИдентификаторыЭДО)");
		Запрос.УстановитьПараметр("ИдентификаторыЭДО", ИдентификаторыЭДО);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипыСинхронизации) Тогда
		УсловияОтбора.Добавить("СостоянияСинхронизацииСЦентромЭДО.ТипСинхронизации В (&ТипыСинхронизации)");
		Запрос.УстановитьПараметр("ТипыСинхронизации", ТипыСинхронизации);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловияОтбора) Тогда
		Разделитель = "
			|	И ";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияОтбора", СтрСоединить(УсловияОтбора, Разделитель));
	Иначе
		Запрос.УстановитьПараметр("УсловияОтбора", Истина);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - см. РегистрСведений.СостоянияСинхронизацииСЦентромЭДО.ИдентификаторЭДО
//  ТипСинхронизации - см. РегистрСведений.СостоянияСинхронизацииСЦентромЭДО.ТипСинхронизации
// 
// Возвращаемое значение:
//  См. РегистрСведений.СостоянияСинхронизацииСЦентромЭДО.МеткаВремени
Функция МеткаВремени(ИдентификаторЭДО, ТипСинхронизации) Экспорт
	
	Выборка = ВыборкаМеткиВремениПоТипу(ИдентификаторЭДО, ТипСинхронизации);
	
	Если Выборка.Следующий() Тогда
		МеткаВремени = Выборка.МеткаВремени;
	Иначе
		МеткаВремени = 0;
	КонецЕсли;
	
	Возврат МеткаВремени;
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - см. РегистрСведений.СостоянияСинхронизацииСЦентромЭДО.ИдентификаторЭДО
//  ТипСинхронизации - см. РегистрСведений.СостоянияСинхронизацииСЦентромЭДО.ТипСинхронизации
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  * МеткаВремени - см. РегистрСведений.СостоянияСинхронизацииСЦентромЭДО.МеткаВремени
Функция ВыборкаМеткиВремениПоТипу(ИдентификаторЭДО, ТипСинхронизации)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостоянияСинхронизацииСЦентромЭДО.МеткаВремени КАК МеткаВремени
		|ИЗ
		|	РегистрСведений.СостоянияСинхронизацииСЦентромЭДО КАК СостоянияСинхронизацииСЦентромЭДО
		|ГДЕ
		|	СостоянияСинхронизацииСЦентромЭДО.ИдентификаторЭДО = &ИдентификаторЭДО
		|	И СостоянияСинхронизацииСЦентромЭДО.ТипСинхронизации = &ТипСинхронизации";
		
	Запрос.УстановитьПараметр("ИдентификаторЭДО", ИдентификаторЭДО);
	Запрос.УстановитьПараметр("ТипСинхронизации", ТипСинхронизации);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Параметры:
//  ВыгрузкаСостоянийСинхронизации - см. РегистрыСведений.СостоянияСинхронизацииСЦентромЭДО.Выгрузить
//  ТипСинхронизации - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  ИдентификаторыЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * МеткаВремени - Число
//  * ИдентификаторЭДО - Строка
Функция МеткиВремениИдентификаторовЭДО(ВыгрузкаСостоянийСинхронизации, ТипСинхронизации, ИдентификаторыЭДО) Экспорт
	
	ТекущаяМетка = 0;
	МеткиВремениПоИдентификаторамЭДО = Новый Соответствие;
	Для Каждого ИдентификаторЭДО Из ИдентификаторыЭДО Цикл
		МеткаВремениПоИдентификаторуЭДО = Новый Структура("МеткаВремени, ИдентификаторЭДО",
			ТекущаяМетка, ИдентификаторЭДО);
		МеткиВремениПоИдентификаторамЭДО.Вставить(ИдентификаторЭДО, МеткаВремениПоИдентификаторуЭДО);
	КонецЦикла;
	
	Для Каждого СостояниеСинхронизации Из ВыгрузкаСостоянийСинхронизации Цикл
		Если СостояниеСинхронизации.ТипСинхронизации <> ТипСинхронизации Тогда
			Продолжить;
		КонецЕсли;
		МеткаВремениПоИдентификаторуЭДО = МеткиВремениПоИдентификаторамЭДО[СостояниеСинхронизации.ИдентификаторЭДО];
		Если МеткаВремениПоИдентификаторуЭДО <> Неопределено Тогда
			МеткаВремениПоИдентификаторуЭДО.МеткаВремени = СостояниеСинхронизации.МеткаВремени;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ВыгрузитьКолонку(МеткиВремениПоИдентификаторамЭДО, "Значение");
	
КонецФункции

// Параметры:
//  РезультатОбработки - Структура:
//  * МеткиВремениПоИдентификаторамЭДО - Соответствие из КлючИЗначение:
//    ** Ключ - Строка
//    ** Значение - Число
//  * ФиксированныеМеткиВремени - Соответствие из КлючИЗначение:
//    ** Ключ - Строка
//    ** Значение - Булево
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ИдентификаторЭДО - Строка
//  * МеткаВремени - Число
Функция МеткиВремениИдентификаторовЭДОПоРезультатуОбработки(РезультатОбработки) Экспорт
	
	МеткиВремениИдентификаторовЭДО = Новый Массив; // Массив из Структура
	ФиксированныеМеткиВремени = РезультатОбработки.ФиксированныеМеткиВремени;
	Для Каждого МеткаВремениПоИдентификаторуЭДО Из РезультатОбработки.МеткиВремениПоИдентификаторамЭДО Цикл
		ИдентификаторЭДО = МеткаВремениПоИдентификаторуЭДО.Ключ;
		МеткаВремени = МеткаВремениПоИдентификаторуЭДО.Значение;
		Если ФиксированныеМеткиВремени[ИдентификаторЭДО] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МеткаВремениИдентификатораЭДО = Новый Структура("ИдентификаторЭДО, МеткаВремени",
			ИдентификаторЭДО, МеткаВремени);
		МеткиВремениИдентификаторовЭДО.Добавить(МеткаВремениИдентификатораЭДО);
	КонецЦикла;
	
	Возврат МеткиВремениИдентификаторовЭДО;
	
КонецФункции

// Параметры:
//  ТипыДанныхДляСинхронизации - Массив из РегистрСведенийКлючЗаписи.СостоянияСинхронизацииСЦентромЭДО
// 
// Возвращаемое значение:
//  Структура:
//  * КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
Функция ПолучитьОбъектыИзСервиса(ТипыДанныхДляСинхронизации) Экспорт
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	Результат = Новый Структура;
	Результат.Вставить("КонтекстДиагностики", КонтекстДиагностики);
	
	//@skip-check invocation-parameter-type-intersect
	ИдентификаторыЭДО = ОбщегоНазначения.ВыгрузитьКолонку(ТипыДанныхДляСинхронизации, "ИдентификаторЭДО", Истина);
	УчетныеЗаписиПоИдентификаторамЭДО = РегистрыСведений.НастройкиИнтеграцииЦентраЭДО.УчетныеЗаписиПоИдентификаторамЭДО(
		ИдентификаторыЭДО);
	
	ВидОперации = НСтр("ru = 'Получение объектов из сервиса'");
	
	Граница = ТипыДанныхДляСинхронизации.ВГраница();
	Индекс = 0;
	
	Пока Граница >= Индекс Цикл
		
		ТипДанныхДляСинхронизации = ТипыДанныхДляСинхронизации[Индекс];
		Индекс = Индекс + 1;
		
		ИдентификаторЭДО = ТипДанныхДляСинхронизации.ИдентификаторЭДО;
		ТипДанных = ТипДанныхДляСинхронизации.ТипСинхронизации;
		
		УчетнаяЗаписьЦентраЭДО = УчетныеЗаписиПоИдентификаторамЭДО[ИдентификаторЭДО];
		Если УчетнаяЗаписьЦентраЭДО = Неопределено Тогда
			ИнтеграцияЦентраЭДО.ДобавитьНеизвестнуюОшибку(КонтекстДиагностики, ВидОперации,
				СтрШаблон(НСтр("ru = 'Не найдена учетная запись центра ЭДО для идентификатора ЭДО %1'"),
					ИдентификаторЭДО));
			Продолжить;
		КонецЕсли;
		
		Если ТипДанных = ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДанныеДокументовЭДО Тогда
			ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ПолучитьПолныеДанныеДокументовПоМеткамВремени(
				УчетнаяЗаписьЦентраЭДО, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторЭДО));
			Продолжить;
		КонецЕсли;
		
		МеткаВремени = МеткаВремени(ИдентификаторЭДО, ТипДанных);
		МеткаВремениПоИдентификаторуЭДО = Новый Структура("МеткаВремени, ИдентификаторЭДО",
			МеткаВремени, ИдентификаторЭДО);
		МеткиВремениПоИдентификаторамЭДО = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
			МеткаВремениПоИдентификаторуЭДО);
		
		Если ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО Тогда
			ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса(
				"ПорцияДанныхСинхронизацииДокументовЭДОПоМеткамВремени", МеткиВремениПоИдентификаторамЭДО);
		ИначеЕсли ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ПриглашенияЭДО Тогда
			ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса(
				"ПорцияДанныхСинхронизацииПриглашенийЭДОПоМеткамВремени", МеткиВремениПоИдентификаторамЭДО);
		ИначеЕсли ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.УчетныеЗаписиЭДО Тогда
			ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса(
				"ПорцияДанныхСинхронизацииУчетныхЗаписейЭДОПоМеткамВремени", МеткиВремениПоИдентификаторамЭДО);
		Иначе
			ИнтеграцияЦентраЭДО.ДобавитьНеизвестнуюОшибку(КонтекстДиагностики, ВидОперации,
				СтрШаблон(НСтр("ru = 'Получение объектов типа ""%1"" не поддерживается'"), ТипДанных));
			Продолжить;
		КонецЕсли;
		
		ПараметрыВыполнения = ИнтеграцияЦентраЭДОПовтИсп.ПараметрыВыполненияМетодаСервиса(УчетнаяЗаписьЦентраЭДО);
		РезультатМетода = ИнтеграцияЦентраЭДО.ВыполнитьМетодСервиса(
			ПараметрыВыполнения, ОписаниеМетода, КонтекстДиагностики);
		Если РезультатМетода = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО Тогда
			ПорцияДанныхСинхронизацииДокументовЭДО = РезультатМетода; // См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.ПорцияДанныхСинхронизацииДокументовЭДОПоМеткамВремени
			РезультатОбновления = ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ОбновитьДокументыЭДОПоДаннымСинхронизации(
				ПорцияДанныхСинхронизацииДокументовЭДО.НаборДанных, КонтекстДиагностики);
			ЭтоПоследний = ПорцияДанныхСинхронизацииДокументовЭДО.ЭтоПоследний;
		ИначеЕсли ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ПриглашенияЭДО Тогда
			ПорцияДанныхСинхронизацииПриглашенийЭДО = РезультатМетода; // См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.ПорцияДанныхСинхронизацииПриглашенийЭДОПоМеткамВремени
			РезультатОбновления = ПриглашенияЭДОИнтеграцияЦентраЭДО.ОбновитьПриглашенияЭДОПоДаннымСинхронизации(
				ПорцияДанныхСинхронизацииПриглашенийЭДО.НаборДанных, КонтекстДиагностики);
			ЭтоПоследний = ПорцияДанныхСинхронизацииПриглашенийЭДО.ЭтоПоследний;
		ИначеЕсли ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.УчетныеЗаписиЭДО Тогда
			ПорцияДанныхСинхронизацииУчетныхЗаписейЭДО = РезультатМетода; // См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.ПорцияДанныхСинхронизацииУчетныхЗаписейЭДОПоМеткамВремени
			ДанныеУчетныхЗаписейЭДО = УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ДанныеСинхронизацииУчетныхЗаписейЭДОИзФорматаСервиса(
				ПорцияДанныхСинхронизацииУчетныхЗаписейЭДО.НаборДанных, УчетнаяЗаписьЦентраЭДО);
			РезультатОбновления = УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ОбновитьУчетныеЗаписиЭДОПоДаннымСинхронизации(
				ДанныеУчетныхЗаписейЭДО, КонтекстДиагностики);
			ЭтоПоследний = ПорцияДанныхСинхронизацииУчетныхЗаписейЭДО.ЭтоПоследний;
		Иначе
			Продолжить;
		КонецЕсли;
		
		ЗаписатьКоллекцию(ТипДанных, РезультатОбновления.МеткиВремениПоИдентификаторамЭДО, КонтекстДиагностики);
		
		Если Не ЭтоПоследний Тогда
			Индекс = Индекс - 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
